/* 
   Localizable.strings
   SecurexamAuthenticate

   Created by Vadim Lozko on 7/8/11.
   Copyright 2011 Software Secure, Inc. All rights reserved.
 */
 
/* New Version Alert Message. */
"NewVersionMsg" = "A new version of Remote Proctor Now is required to access your exam.";

/* New Version Alert Info. */
"NewVersionInfo" = "Press OK to launch your web browser and load the Remote Proctor Now download page.";

/* New Safari Version Alert Message. */
"NewSafariVersionMsg" = "A newer version of Safari is required to use Remote Proctor Now.";

/* New Safari Version Alert Info. */
"NewSafariVersionInfo" = "Download and install the latest software updates for your Mac to ensure Remote Proctor Now works properly.";

/* Multiple Displays Alert Message 1. */
"DisplayErrorMsg1" = "Remote Proctor Now cannot start because there are multiple screens detected.";

/* Multiple Displays Alert Info 1. */
"DisplayErrorInfo1" = "To continue, you may either launch the 'Display' preferences and under the 'Arrangement' tab set all your screens to be mirrored or you may disconnect any extra displays.";

/* Multiple Displays Alert Message 2. */
"DisplayErrorMsg2" = "Remote Proctor Now has detected a newly attached screen and will exit.";

/* Multiple Displays Alert Info 2. */
"DisplayErrorInfo2" = "Upon clicking 'OK' you will have 30 seconds to save your exam before the software will exit you back to the desktop.\
\
If you do not respond to this message in 1 minute, the program will automatically close after 30 seconds.\
\
Contact your organization for further instructions.";

/* Multiple Displays Mirrored Alert Message 1. */
"DisplayMirroredErrorMsg1" = "Remote Proctor Now cannot start because there are multiple screens detected.";

/* Multiple Displays Mirrored  Alert Info 1. */
"DisplayMirroredErrorInfo1" = "To continue, disconnect any extra displays.";

/* Multiple Displays Mirrored Alert Message 2. */
"DisplayMirroredErrorMsg2" = "Remote Proctor Now has detected a newly attached screen and will exit.";

/* Multiple Displays Mirrored  Alert Info 2. */
"DisplayMirroredErrorInfo2" = "The use of multiple displays is not allowed. Please contact an administrator for futher instructions.";

/* Single Location Start Alert Message. */
"SingLocStartMsg" = "You will now be redirected to the exam's login site.";

/* Multiple Locations Start Alert Message. */
"MultLocsStartMsg" = "Please choose the login site to redirect to.";

/* Start Alert Info. */
/* "StartInfo" = "You will have %d minutes to start the exam. Otherwise you will have to re-authenticate."; */
"StartInfo" = "1.  You now have %d minutes to start your exam, otherwise, you will need to start the process over again.\n\
2.  Navigate to your exam start page and if your exam requires a password, you must click on the \"Insert Exam Password\" button at the top of your screen when prompted to enter the exam password.\n\
3.  Take your exam.\n\
4.  Remember to follow your institution’s exam policy to avoid being flagged for violations.";

/* Exam Entrance Time Expired Alert Message 1. */
"ExamEntrTimeExpiredMsg1" = "Do you need more time to enter the exam?";

/* Exam Entrance Time Expired Alert Info 1. */
"ExamEntrTimeExpiredInfo1" = "You may request up to %d more minute(s) to enter the exam. If you are already in the exam, please ignore this message.";

/* Exam Entrance Time Expired Button Request More Time */
"ExamEntrTimeExpiredButtonR" = "I need more time";

/* Exam Entrance Time Expired Button Ignore */
"ExamEntrTimeExpiredButtonI" = "I'm in the exam now";

/* Exam Entrance Time Expired Button Quit */
"ExamEntrTimeExpiredButtonQ" = "Quit";


/* Exam Entrance Time Expired Alert Message 2. */
"ExamEntrTimeExpiredMsg2" = "The exam password has expired.";

/* Exam Entrance Time Expired Alert Info 2. */
"ExamEntrTimeExpiredInfo2" = "You will need to restart the authentication process in order to take your exam.";

/* Exam Time Expired Alert Message. */
"ExamTimeExpiredMsg" = "Do you wish to continue with the exam?";

/* Exam Time Expired Alert Info. */
"ExamTimeExpiredInfo" = "The exam has been in progress for %d minutes. You may request additional time or quit if you have already finished your exam.";

/* No Password Field Available Alert Message. */
"NoPasswordFieldAvailableMsg" = "A password field could not be found.";

/* No Password Field Available Alert Info. */
"NoPasswordFieldAvailableInfo" = "Please navigate to the password submission page that contains a password field before trying again.";

/* Flash Plugin Error Message. */
"FlashPluginErrorMsg" = "Error while trying to load the Flash plugin: %@.";

/* Flash Plugin Error Info. */
"FlashPluginErrorInfo" = "Press OK to exit Remote Proctor Now and download and install the latest version of Flash for Safari.  Restart Remote Proctor Now after installing Flash.";

/* Non-Flash Plugin Error Message. */
"NonFlashPluginErrorMsg" = "Error while trying to load the plugin for media type %@: %@.";

/* Non-Flash Plugin Error Info. */
"NonFlashPluginErrorInfo" = "You may need a plug-in to complete this exam.  Check your exam materials for info.  Press OK to continue.";

/* Quit Alert Message */
"QuitAlertMsg" = "Are you sure you want to quit?";

/* Quit Alert Info. */
"QuitAlertInfo" = "If you are in an exam, please ensure you have submitted your answers before quitting.";
